       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDMS-TEST.
       ENVIRONMENT DIVISION.
       IDMS-CONTROL SECTION.
       PROTOCOL. MODE IS BATCH DEBUG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-STATUS           PIC X(4) VALUE SPACES.
       PROCEDURE DIVISION.
       MAIN-PARA.
           BIND RUN-UNIT.
           READY.
           FINISH.
           STOP RUN.
