00100  IDENTIFICATION DIVISION.
00200  PROGRAM-ID. MyCOBOLProgram.
00300  ENVIRONMENT DIVISION.
00400  CONFIGURATION SECTION.
00500  SOURCE-COMPUTER. IBM-PC.
00600  OBJECT-COMPUTER. IBM-PC.
00700  DATA DIVISION.
00800  WORKING-STORAGE SECTION.
01000     01  WS-SAVE-PACKAGE      PIC X(10).
01200  PROCEDURE DIVISION.
01500  MAIN-PROCEDURE.
01600      EXEC SQL
01610          SET :WS-SAVE-PACKAGE = CURRENT PACKAGESET
01620      END-EXEC.
01621      DISPLAY 'Current Package set: ' WS-SAVE-PACKAGE.
01800      STOP RUN.
