       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
               01 SOME-GROUP OCCURS 2.
                    10 LEVEL-10-A  PIC XXXX OCCURS 3.
       PROCEDURE DIVISION.
       STOP RUN.

