       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
           WORKING-STORAGE SECTION.
               01 EXCHANGE-PART-01 PIC XXXX.
                    10 LOADBUCKET-LAT-BEGN  USAGE COMP-1.
       PROCEDURE DIVISION.
       SECTION-0 SECTION.
        P1.
           STOP RUN.

